USE 'mssql://server_address/database_name'

-- *******************************************************************
-- * Создание последовательности для РегистрСведений.ВходящаяОчередь *
-- *******************************************************************
CREATE SEQUENCE so_inbox_sequence

-- ********************************************************************
-- * Создание последовательности для РегистрСведений.ИсходящаяОчередь *
-- ********************************************************************
CREATE SEQUENCE so_outbox_sequence

-- **********************************************************************
-- * Применение последовательности для РегистрСведений.ИсходящаяОчередь *
-- * на измерении "НомерСообщения" - создание триггеров СУБД для INSERT *
-- **********************************************************************
APPLY SEQUENCE so_outbox_sequence
   ON РегистрСведений.ИсходящаяОчередь(НомерСообщения) --RECALCULATE

-- *********************************************************
-- * Удаление ранее созданных объектов последовательностей *
-- *********************************************************
-- DROP SEQUENCE so_inbox_sequence
-- DROP SEQUENCE so_outbox_sequence

-- *****************************************************************
-- * Отмена использования последовательности для регистра сведений *
-- *****************************************************************
-- REVOKE SEQUENCE so_outbox_sequence
--     ON РегистрСведений.ИсходящаяОчередь